DataProcessors/Renault_ARM_Администратор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ARM_Администратор</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_НормализованныеКонтактыДляПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НормализованныеКонтактыДляПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ЗначенияРеквизитовТрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗначенияРеквизитовТрафика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_РеквизитыТрафика</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитТрафика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_РеквизитыТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ЗамечанияМенеджерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗамечанияМенеджерам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстЗамечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_ПервичныйПовторный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ПервичныйПовторный</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_ARM_Администратор/Forms/РегистрацияУПР/Ext/Form/Module.bsl
&НаКлиенте 
Перем СтруктураОткрываемыхФорм;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьНаСервис = Ложь;
	Жалоба = Ложь;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//брендовое оформление
	Массив=Новый Массив;
	Массив.Добавить(Элементы.кнРегистрация);	
	Массив.Добавить(Элементы.КнопкаКарточкаКлиента);	
	
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветФона","ОсновнойЦвет");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветРамки","ОсновнойЦвет");
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветТекста","ЦветТекста");

	Если ЗначениеЗаполнено(ЭтаФорма.ВладелецФормы) Тогда
		Если ЭтаФорма.ВладелецФормы.ТекущийЭлемент.Имя = "кнПосещение" Тогда
			ЭтаФорма.Заголовок = НСтр("ru = 'Регистрация нового трафика. Посещение'");
		ИначеЕсли ЭтаФорма.ВладелецФормы.ТекущийЭлемент.Имя = "кнЗвонок" Тогда
			ЭтаФорма.Заголовок = НСтр("ru = 'Регистрация нового трафика. Звонок'");
		ИначеЕсли ЭтаФорма.ВладелецФормы.ТекущийЭлемент.Имя = "кнEmail" Тогда
			ЭтаФорма.Заголовок = НСтр("ru = 'Регистрация нового трафика. Email'");
			Элементы.ДекорацияТелефон.Картинка = БиблиотекаКартинок.Renault_Mail_New_20;
			Элементы.Телефон.Маска =  "";	
		КонецЕсли;
	КонецЕсли;
		
	ЗаполнитьДанныеНаСервере();

    ОпределитьТипТрафикаНаСервере(ЭтаФорма.ВладелецФормы.ТекущийЭлемент.Имя);
				
	ОбновитьСтруктуруОткрываемыхФорм();
	ОбновлениеОтображения();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТипТрафикаНаСервере(Владелец)
	
	Если Владелец = "кнПосещение" Тогда
		ТипТрафика = Справочники.CRM_ТипТрафика.ПосещениеАвтосалона;
	ИначеЕсли Владелец = "кнЗвонок" Тогда
		ТипТрафика = Справочники.CRM_ТипТрафика.Звонок;
	ИначеЕсли Владелец = "кнEmail" Тогда
		ТипТрафика = Справочники.CRM_ТипТрафика.EmailДилера;
	ИначеЕсли Владелец = "кнЛидRenault" Тогда
		ТипТрафика = Справочники.CRM_ТипТрафика.ЛидДилера;
	Иначе
		ТипТрафика = Справочники.CRM_ТипТрафика.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипТрафика <> Справочники.CRM_ТипТрафика.EmailДилера Тогда
		
		Если ЗначениеЗаполнено(ДилерскийЦентр) Тогда
			ПервыйСимволТелефона = ДилерскийЦентр.ПервыйСимволТелефона;
			
			Если НЕ ПустаяСтрока(ПервыйСимволТелефона) Тогда
				МаскаТелефона = Элементы.Телефон.Маска;
				
				ОстатокМаски = Прав(МаскаТелефона, СтрДлина(МаскаТелефона) - 1);
				
				МаскаТелефона = ПервыйСимволТелефона + ОстатокМаски;
				
				Элементы.Телефон.Маска = МаскаТелефона;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаСервере()
	
	ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	ОтделАвтосалона = Renault_CRM.ПолучитьОтделАвтосалона(ДилерскийЦентр); 
	Марка = ОтделАвтосалона.БрендМарка;

	ЗаполнятьАдминистратораТрафикаТекущимПользователем = ПараметрыСеанса.Renault_ПраваПользователя.ЗаполнятьАдминистратораТрафикаТекущимПользователем;
	
	Если ЗаполнятьАдминистратораТрафикаТекущимПользователем Тогда
		Администратор = ПараметрыСеанса.Пользователь.Сотрудник;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтруктуруОткрываемыхФорм()
	
	СтруктураОткрываемыхФорм = Новый Структура;
	СтруктураОткрываемыхФорм.Вставить("ОткрыватьИсточникИнформации", Истина);
	СтруктураОткрываемыхФорм.Вставить("ОткрыватьМодель", Истина);
	СтруктураОткрываемыхФорм.Вставить("ОткрыватьМенеджер", Истина);
	СтруктураОткрываемыхФорм.Вставить("ОткрыватьАдминистратор", Истина);
	
	СтрокаНастроек = ПолучитьНастройкиТрафика(ДилерскийЦентр, Отдел, ПервичныйПовторный, ТипТрафика);
	
	Если СтрокаНастроек.Количество()>0 Тогда
		СтруктураОткрываемыхФорм.Вставить("ОткрыватьИсточникИнформации", СтрокаНастроек.ОткрыватьИсточникИнформации);
		СтруктураОткрываемыхФорм.Вставить("ОткрыватьМодель", СтрокаНастроек.ОткрыватьМодель);
		СтруктураОткрываемыхФорм.Вставить("ОткрыватьМенеджер", СтрокаНастроек.ОткрыватьМенеджер);
		СтруктураОткрываемыхФорм.Вставить("ОткрыватьАдминистратор", СтрокаНастроек.ОткрыватьАдминистратор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиТрафика(ДилерскийЦентр, Отдел, ПервичныйПовторный, ТипТрафика)
	
	СтруктураНастроек = Новый Структура;

	Если ДилерскийЦентр <> Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка() И Отдел <> Справочники.CRM_Отделы.ПустаяСсылка() И ПервичныйПовторный <> Перечисления.CRM_ПервичныйПовторный.ПустаяСсылка() Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ТипТрафика", ТипТрафика);
		Отбор.Вставить("Отдел", ?(Отдел.ПродажаАвтомобилей, "Отдел продаж", "Другой отдел"));
		Отбор.Вставить("ПервичныйПовторный", ПервичныйПовторный);
		НастройкиРегистрацииТрафика = ДилерскийЦентр.НастройкиРегистрацииТрафика.НайтиСтроки(Отбор);
		Если НастройкиРегистрацииТрафика.Количество()>0 Тогда
		    СтруктураНастроек.Вставить("ОткрыватьИсточникИнформации", НастройкиРегистрацииТрафика[0].ОткрыватьИсточникИнформации);
		    СтруктураНастроек.Вставить("ОткрыватьМодель", НастройкиРегистрацииТрафика[0].ОткрыватьМодель);
		    СтруктураНастроек.Вставить("ОткрыватьМенеджер", НастройкиРегистрацииТрафика[0].ОткрыватьМенеджер);
		    СтруктураНастроек.Вставить("ОткрыватьАдминистратор", НастройкиРегистрацииТрафика[0].ОткрыватьАдминистратор);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

&НаКлиенте
Процедура ОбновлениеОтображения()
	
	Парам=Renault_ОбщиеФункции.МультибрендПараметрыОформления();

	ЦветРено = Вычислить(Парам.ОсновнойЦвет);;
	ЦветБелый = Новый Цвет(255, 255, 255);
	ЦветСерый = Новый Цвет(153, 153, 153);
	
	ЦветЗаполнено = ЦветРено;
	ЦветРамкиНеВыбрано = Новый Цвет(153, 153, 153);
	ЦветНеЗаполнено = Новый Цвет(49, 52, 49);
	ЦветВыбрано = Вычислить(Парам.ОсновнойЦвет);
	ЦветНеВыбрано = Новый Цвет(49, 52, 49);
	ЦветВыбрано = ЦветРено;
	ЦветРамкиВыбрано = Вычислить(Парам.ОсновнойЦвет);
	ЦветТекстаВыбрано = Новый Цвет(49, 52, 49); //Черный
	ЦветФонаНеВыбрано = Новый Цвет(212, 212, 212); //Серый
	ЦветФонаВыбрано = ЦветРено;
	
	ПараметрыРаскраски = ПолучитьПараметрыРаскраскиФормы();
	
	ВыделятьКнИсточникИнформации = ЗначениеЗаполнено(ИсточникИнформации);
	ВыделятьКнМодель = ЗначениеЗаполнено(Модель);
	ВыделятьКнМенеджер = ЗначениеЗаполнено(Сотрудник);
	ВыделятьКнАдминистратор = ЗначениеЗаполнено(Администратор);
	
	ВыделятьКнОтделПродажи = ЗначениеЗаполнено(Отдел) И (Отдел = ОтделАвтосалона);
	ВыделятьКнОтделДругой = ЗначениеЗаполнено(Отдел) И (Отдел <> ОтделАвтосалона);
	
	ВыделятьКнЗамечаниеМенеджеру = (СтрДлина(СокрЛП(ТекстЗамечания)) > 0);
	ВыделятьКнУпущенныйКлиент = ЗначениеЗаполнено(ПричинаУпущенногоКлиента);
	ВыделятьКнЗаменаМенеджера = ЗначениеЗаполнено(МенеджерЗамены);
	ВыделятьКнПерезвонить = Перезвонить;

	Элементы.кнИсточникИнформации.Видимость = ПараметрыРаскраски.ВидимостьКнИсточникИнформации;
	Элементы.кнЗаменаМенеджера.Видимость = ПараметрыРаскраски.ВидимостьКнЗаменаМенеджера;
	
	Элементы.кнВыборДЦ.Заголовок = Строка(ДилерскийЦентр);
	
	Кнопка = Элементы.кнТипПервичный;
	Если ПараметрыРаскраски.ВыделятьКнПервичный Тогда
		Кнопка.ЦветРамки = ЦветРамкиВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеВыбрано;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнТипПовторный;
	Если ПараметрыРаскраски.ВыделятьКнПовторный Тогда
		Кнопка.ЦветРамки = ЦветРамкиВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеВыбрано;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнТипЖалоба;
	
	Если Жалоба Тогда
		
		Кнопка.ЦветРамки = ЦветРамкиВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = WebЦвета.Красный;
		
	Иначе
		
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = Новый Цвет (128,0,0);
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
		
	КонецЕсли;
	
	Кнопка = Элементы.кнПолМужской;
	Если ПараметрыРаскраски.ВыделятьКнПолМужской Тогда
		Кнопка.ЦветРамки = ЦветРамкиВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеВыбрано;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнПолЖенский;
	Если ПараметрыРаскраски.ВыделятьКнПолЖенский Тогда
		Кнопка.ЦветРамки = ЦветРамкиВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеВыбрано;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнОтделПродажи;
	Если ВыделятьКнОтделПродажи Тогда
		Кнопка.ЦветРамки = ЦветРамкиВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеВыбрано;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнОтделДругой;
	Если ВыделятьКнОтделДругой Тогда
		Кнопка.Заголовок = "Отдел: " + Строка(Отдел);
		Кнопка.ЦветРамки = ЦветРамкиВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Кнопка.Заголовок = "Другой отдел";
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеВыбрано;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнИсточникИнформации;
	Если ВыделятьКнИсточникИнформации Тогда
		Кнопка.Заголовок = "Источник информации: " + Строка(ИсточникИнформации);
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Кнопка.Заголовок = "Источник информации: не заполнено";
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеЗаполнено;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнМодель;
	Если ВыделятьКнМодель Тогда
		Кнопка.Заголовок = "Модель: " + Строка(Модель);
		Кнопка.ЦветРамки = ЦветРамкиВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Кнопка.Заголовок = "Модель: не заполнено";
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеЗаполнено;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнМенеджер;
	Если ЗаписьНаСервис Тогда
	
		Если ВыделятьКнМенеджер Тогда
			Кнопка.Заголовок = "Мастер-приемщик: " + Строка(Сотрудник);
			Кнопка.ЦветРамки = ЦветРамкиВыбрано;
			Кнопка.ЦветТекста = ЦветТекстаВыбрано;
			Кнопка.ЦветФона = ЦветФонаВыбрано;
		Иначе
			Кнопка.Заголовок = "Мастер-приемщик: не заполнено";
			Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
			Кнопка.ЦветТекста = ЦветНеЗаполнено;
			Кнопка.ЦветФона = ЦветФонаНеВыбрано;
		КонецЕсли;
		
		Элементы.кнТипЖалоба.Видимость = Истина;
		
	Иначе
		
		Если ВыделятьКнМенеджер Тогда
			Кнопка.Заголовок = "Менеджер: " + Строка(Сотрудник);
			Кнопка.ЦветРамки = ЦветРамкиВыбрано;
			Кнопка.ЦветТекста = ЦветТекстаВыбрано;
			Кнопка.ЦветФона = ЦветФонаВыбрано;
		Иначе
			Кнопка.Заголовок = "Менеджер: не заполнено";
			Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
			Кнопка.ЦветТекста = ЦветНеЗаполнено;
			Кнопка.ЦветФона = ЦветФонаНеВыбрано;
		КонецЕсли;
		
		Элементы.кнТипЖалоба.Видимость = Ложь;
	
	КонецЕсли;

	Кнопка = Элементы.кнАдминистратор;
	Если ВыделятьКнАдминистратор Тогда
		Кнопка.Заголовок = "Администратор: " + Строка(Администратор);
		Кнопка.ЦветРамки = ЦветРамкиВыбрано;
		Кнопка.ЦветТекста = ЦветТекстаВыбрано;
		Кнопка.ЦветФона = ЦветФонаВыбрано;
	Иначе
		Кнопка.Заголовок = "Администратор: не заполнено";
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеЗаполнено;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнЗамечаниеМенеджеру;
	Если ВыделятьКнЗамечаниеМенеджеру Тогда
		Кнопка.ЦветРамки = ЦветРено;
		Кнопка.ЦветТекста = ЦветРено;
		Кнопка.ЦветФона = ЦветБелый;
	Иначе
		Кнопка.ЦветРамки = ЦветСерый;
		Кнопка.ЦветТекста = ЦветНеВыбрано;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнУпущенныйКлиент;
	Если ВыделятьКнУпущенныйКлиент Тогда
		Кнопка.ЦветРамки = ЦветРено;
		Кнопка.ЦветТекста = ЦветРено;
		Кнопка.ЦветФона = ЦветБелый;
	Иначе
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветНеВыбрано;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнЗаменаМенеджера;
	Если ВыделятьКнЗаменаМенеджера Тогда		
		Кнопка.ЦветРамки = ЦветРено;
		Кнопка.ЦветТекста = ЦветРено;
		Кнопка.ЦветФона = ЦветБелый;
	Иначе
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = ЦветРено;
		Кнопка.ЦветФона = ЦветФонаНеВыбрано;
	КонецЕсли;
	
	Кнопка = Элементы.кнПерезвонить;
	Если ВыделятьКнПерезвонить Тогда		
		Кнопка.ЦветРамки = ЦветРено;
		Кнопка.ЦветТекста = Новый Цвет(49, 52, 49);
		Кнопка.ЦветФона = ЦветРено;
		Кнопка.Картинка = БиблиотекаКартинок.Renault_Confirm_Square;
	Иначе
		Кнопка.ЦветРамки = ЦветРамкиНеВыбрано;
		Кнопка.ЦветТекста = Новый Цвет(49, 52, 49);
		Кнопка.ЦветФона = Новый Цвет(245, 245, 245);
		Кнопка.Картинка = БиблиотекаКартинок.Renault_Square_NEw;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Клиент) Тогда
		Элементы.КнопкаКарточкаКлиента.Видимость = Истина;
	Иначе
		Элементы.КнопкаКарточкаКлиента.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыРаскраскиФормы()
	
	ПараметрыРаскраски = Новый Структура;
	
	ПараметрыРаскраски.Вставить("ВыделятьКнПервичный", ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный);
	ПараметрыРаскраски.Вставить("ВыделятьКнПовторный", ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Повторный);
	
	ПараметрыРаскраски.Вставить("ВыделятьКнПолМужской", Пол = Перечисления.ПолФизическихЛиц.Мужской);
	ПараметрыРаскраски.Вставить("ВыделятьКнПолЖенский", Пол = Перечисления.ПолФизическихЛиц.Женский);
		
	ПараметрыРаскраски.Вставить("ВидимостьКнИсточникИнформации", НЕ ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Повторный);
	ПараметрыРаскраски.Вставить("ВидимостьКнЗаменаМенеджера", ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Повторный);
	
	Возврат ПараметрыРаскраски;

КонецФункции

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	Если СтрДлина(ФИО) > 0 и Не ЗначениеЗаполнено(Клиент) Тогда
		
		Однофамильцы = ПолучитьКлиентовПоФИО(ФИО);
		
		Если Однофамильцы.Количество()>0 Тогда
			Парам = Новый Структура;
			Парам.Вставить("Список", Однофамильцы);
			Парам.Вставить("Заголовок", "Найдены клиенты с ФИО");

			ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);
			
			Ответ = ФормаСписка.ОткрытьМодально();
			Если Ответ <> Неопределено Тогда
				Клиент = Ответ;
				ФИО = Ответ.Наименование;
				Пол = Ответ.Пол;
				Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
				ОбновлениеОтображения();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлиентовПоФИО(ФИО)
	
	сКлиентов = Новый СписокЗначений;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_НормализованныеКонтактыДляПоиска.Объект
	|ИЗ
	|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска
	|ГДЕ
	|	(Renault_НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.Контрагенты
	|			ИЛИ Renault_НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты)
	|	И Renault_НормализованныеКонтактыДляПоиска.Объект.Наименование подобно &Наименование";
	Запрос.УстановитьПараметр("Наименование", "%"+СокрЛП(ФИО)+"%");
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат сКлиентов;
	КонецЕсли;
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		сКлиентов.Добавить(Выборка.Объект, Строка(Выборка.Объект));
	КонецЦикла;

	Возврат сКлиентов;
	
КонецФункции

&НаКлиенте
Процедура кнВыборДЦНажатие(Команда)
	
	ОтделАвтосалона = Неопределено;
	
	Список = Renault_CRM.ПолучитьСписокДилерскихЦентров();
	
	Парам = Новый Структура;
	Парам.Вставить("Список", Список);
	Парам.Вставить("Заголовок", "Выбор дилерского центра");
	//Парам.Вставить("КоличествоЭлементовВСтроке", 2);
	Парам.Вставить("ШиринаЭлемента",17);
	Парам.Вставить("ВысотаЭлемента",2);

	ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);
	
	Ответ = ФормаСписка.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		ДилерскийЦентр = Ответ;
	Иначе
		ДилерскийЦентр = Неопределено;
	КонецЕсли;
	
	Отдел = Неопределено;
	Сотрудник = Неопределено;
	
	ОтделАвтосалона = Renault_CRM.ПолучитьОтделАвтосалона(ДилерскийЦентр); 
	Марка = ОтделАвтосалона.БрендМарка;
	
	ОбновитьСтруктуруОткрываемыхФорм();
	
	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	
	Если ТипТрафика = ТипТрафикаЭлПисьмо() Тогда
		
		ВыбратьКонтрагентаПоEmail();
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		ВыбратьКонтрагентаПоТелефону();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипТрафикаЭлПисьмо()
	Возврат Справочники.CRM_ТипТрафика.EmailДилера;
КонецФункции

&НаКлиенте
Процедура ТелефонОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ТипТрафика <> ТипТрафикаЭлПисьмо() Тогда
		
		ДлинаТекста = СтрДлина(Текст);
		
		ТекстЗамечанияПервый = "";
		Если ДлинаТекста < 11 Тогда
			ТекстЗамечанияПервый = "Телефон состоит из - " + ДлинаТекста + " цифр, а должен состоять из 11 цифр" + Символы.ПС;
		КонецЕсли;
		
		СтрокаПроверки = "0123456789+";
		ТекстЗамечанияВторой = "";
		
		Для Счетчик = 1 По ДлинаТекста Цикл
			СимволСтроки = Сред(Текст, Счетчик, 1);
			
			Если СтрЧислоВхождений(СтрокаПроверки, СимволСтроки) = 0 Тогда
				ТекстЗамечанияВторой = "В номере телефон, кроме цифр и знака ""+"", не должно содержаться других символов!";
				Прервать;
			КонецЕсли;			
		КонецЦикла;
		
		ОбщийТекстЗамечания = ТекстЗамечанияПервый + ТекстЗамечанияВторой;
		
		Если ЗначениеЗаполнено(ОбщийТекстЗамечания) Тогда
			Предупреждение(ОбщийТекстЗамечания,, "Замечание по вводу номера телефона");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура кнПерезвонить(Команда)
	
	Перезвонить = Не Перезвонить;
	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура кнРегистрация(Команда)
	
	ТрафикУпущен = СтрДлина(ТекстКомментарияУпущен) > 0 ИЛИ ПричинаУпущенногоКлиента <> ПолучитьПричинуУпущенияПустая();
	ЕстьЗамечаниеМенеджеру = (СтрДлина(ТекстЗамечания) > 0);
	МенеджерЗаменен = ЗначениеЗаполнено(МенеджерЗамены);
	СоздаемРЛ = Не ТрафикУпущен И не ЗаписьНаСервис;
	ЕстьТД = ЗначениеЗаполнено(НомерТестДрайва);
	ВОтделПродаж = (Отдел = ОтделАвтосалона);
	
	Если Не ПроверитьЗаполнениеРеквизитов(ТрафикУпущен) Тогда
		Возврат;
	КонецЕсли;

	////////////////////////////////////////////////
	//Фиксация трафика
	
	Если ЗаписьНаСервис = Ложь Тогда
	
		Идентификатор = "";
		Если ЗначениеЗаполнено(Клиент) Тогда
			
			РабЛистКлиента = ПолучитьРабЛистКлиента();
			
			Если ЗначениеЗаполнено(РабЛистКлиента) Тогда
			
				Ответ = Вопрос("По клиенту уже есть рабочий лист в работе: №" + РабЛистКлиента.IDK + ", менеджер:" + РабЛистКлиента.Сотрудник + ". Вы хотите использовать его?", РежимДиалогаВопрос.ДаНет);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Идентификатор = РабЛистКлиента.IDТрафика;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	кнРегистрацияНаСервере(Идентификатор, ТрафикУпущен, ЕстьТД, ЕстьЗамечаниеМенеджеру, ВОтделПродаж, МенеджерЗаменен);
		
	Закрыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПричинуУпущенияПустая()
	Возврат Справочники.CRM_ПричиныУпущенныхКлиентов.ПустаяСсылка();
КонецФункции

&НаСервере
Функция ПолучитьРабЛистКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.IDK,
	|	Renault_РабочиеЛисты.IDТрафика,
	|	Renault_РабочиеЛисты.Сотрудник
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.Клиент = &Клиент
	|	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;	
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура кнРегистрацияНаСервере(Идентификатор, ТрафикУпущен, ЕстьТД, ЕстьЗамечаниеМенеджеру, ВОтделПродаж, МенеджерЗаменен)
		
	Если Идентификатор = "" ИЛИ НЕ ЗначениеЗаполнено(Идентификатор) Тогда
		
		ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
		
		ЗаписьТрафик.Период = ТекущаяДата();
		Идентификатор = Новый УникальныйИдентификатор();
		ЗаписьТрафик.ТипТрафика = ТипТрафика;
		ЗаписьТрафик.Идентификатор = Идентификатор;
		ЗаписьТрафик.Менеджер = Сотрудник;
		ЗаписьТрафик.Администратор = Администратор;
		ЗаписьТрафик.Отдел = Отдел;
		ЗаписьТрафик.Клиент = Клиент;
		ЗаписьТрафик.ДилерскийЦентр = ДилерскийЦентр;
		ЗаписьТрафик.ПервичныйИнтерес = Модель;
		ЗаписьТрафик.ИсточникИнформации = ИсточникИнформации;
		ЗаписьТрафик.ПервичныйПовторный = ПервичныйПовторный;
		ЗаписьТрафик.Представление = ФИО;
		ЗаписьТрафик.Обработан = ТрафикУпущен ИЛИ ЕстьТД;
		ЗаписьТрафик.Комментарий = Комментарий;
		
		ЗаписьТрафик.Записать();
		
		//создать задачу в ОФУ
		Задачи.Renault_События.СоздатьНовую("",Справочники.CRM_ВидыСобытий.КонсультацияОФУ,"Консультация ОФУ (трафик "+ТипТрафика+")",ДилерскийЦентр,,Отдел,,Клиент);
		
	КонецЕсли;
	
	//Создадим типизированные колонки в ТЗ
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗначенияРеквизитовТрафика.РеквизитТрафика КАК РеквизитТрафика,
	                      |	CRM_ЗначенияРеквизитовТрафика.ЗначениеРеквизита КАК ЗначениеРеквизита,
	                      |	CRM_ЗначенияРеквизитовТрафика.ИдентификаторТрафика
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗначенияРеквизитовТрафика КАК CRM_ЗначенияРеквизитовТрафика
	                      |ГДЕ
	                      |	CRM_ЗначенияРеквизитовТрафика.ИдентификаторТрафика ЕСТЬ NULL ");
	РеквизитыТрафика = Запрос.Выполнить().Выгрузить();
	//Удалим "лишние записи" на всякий случай
	РеквизитыТрафика.Очистить();
	
	//Заполним реквизиты трафика
	
	//Пол
	НовоеСвойство = РеквизитыТрафика.Добавить();
	НовоеСвойство.ИдентификаторТрафика = Идентификатор;
	НовоеСвойство.РеквизитТрафика = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.Пол;
	НовоеСвойство.ЗначениеРеквизита = Пол;	
	
	Если ТипТрафика = Справочники.CRM_ТипТрафика.EmailДилера Тогда
		
		//email
		НовоеСвойство = РеквизитыТрафика.Добавить();
		НовоеСвойство.ИдентификаторТрафика = Идентификатор;
		НовоеСвойство.РеквизитТрафика = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.Email;
		НовоеСвойство.ЗначениеРеквизита = Телефон;
		
	Иначе
		
		//Телефон
		НовоеСвойство = РеквизитыТрафика.Добавить();
		НовоеСвойство.ИдентификаторТрафика = Идентификатор;
		НовоеСвойство.РеквизитТрафика = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.Телефон;
		НовоеСвойство.ЗначениеРеквизита = Телефон;
		
	КонецЕсли;
	
	//Запись в регистр
	НЗ = РегистрыСведений.CRM_ЗначенияРеквизитовТрафика.СоздатьНаборЗаписей();
	НЗ.Отбор.ИдентификаторТрафика.Установить(Идентификатор);
	НЗ.Прочитать();
	НЗ.Загрузить(РеквизитыТрафика);
	Нз.Записать();
	
	//Фиксация трафика
	////////////////////////////////////////////////
	
	////////////////////////////////////////////////
	//Фиксация упущенного трафика

	Если ТрафикУпущен Тогда
		
		Запись = РегистрыСведений.CRM_УпущенныйТрафик.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.ИдентификаторТрафика = Идентификатор;
		Запись.Менеджер = Сотрудник;
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		Запись.Комментарий = СокрЛП(ТекстКомментарияУпущен);
		Запись.Причина = ПричинаУпущенногоКлиента;
		Запись.АвторКомментария = Администратор;
		Запись.ВидУпущения = Перечисления.CRM_ТипыУпущенияТрафика.Менеджер;
		Запись.Записать();
		
	КонецЕсли;
	
	//Фиксация упущенного трафика
	////////////////////////////////////////////////
	
	////////////////////////////////////////////////
	//Фиксация замечания менеджеру
	
	Если ЕстьЗамечаниеМенеджеру Тогда
		
		Запись = РегистрыСведений.CRM_ЗамечанияМенеджерам.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.ИдентификаторТрафика = Идентификатор;
		Запись.Менеджер = Сотрудник;
		Запись.ТекстЗамечания = СокрЛП(ТекстЗамечания);
		Запись.Записать();
		
	КонецЕсли;
	
	//Фиксация замечания менеджеру
	////////////////////////////////////////////////
	
	////////////////////////////////////////////////
	//Фиксация задачи по трафику
	
	Если Перезвонить Тогда
		
		Запись = РегистрыСведений.CRM_ЗадачиПоТрафику.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.ИдентификаторТрафика = Идентификатор;
		Запись.ИдентификаторЗадачи = Новый УникальныйИдентификатор;
		Запись.ТипЗадачи = Перечисления.CRM_ТипыЗадачПоТрафику.ПерезвонПоПросьбеКлиента;
		Запись.Менеджер = Сотрудник;
		Запись.Автор = Администратор;
		Запись.Комментарий = СокрЛП(Комментарий);
		Запись.Телефон = Телефон;
		Запись.Представление = ФИО;
		Запись.Обработано = Ложь;
		Запись.Записать();
		
	КонецЕсли;
	
	//Фиксация задачи по трафику
	////////////////////////////////////////////////
	
	////////////////////////////////////////////////
	//Фиксация замены менеджера
	
	Если МенеджерЗаменен Тогда
		
		Запись = РегистрыСведений.CRM_ЗаменыМенеджеров.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.ИдентификаторТрафика = Идентификатор;
		Запись.МенеджерЗаменил = Сотрудник;
		Запись.МенеджерЗаменен = МенеджерЗамены;
		Запись.Записать();
		
	КонецЕсли;
	
	//Фиксация замены менеджера
	////////////////////////////////////////////////
	
	////////////////////////////////////////////////
	//создание рабочего листа и ТД
	
	Если ЕстьТД Тогда
		
		ЗаписьРЛ = Renault_CRM.СоздатьРабочийЛистПоТрафику(ЗаписьТрафик.Идентификатор);
		Если ЗаписьРЛ <> Неопределено Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CRM_ЗаписьНаТестДрайв.Ссылка
			               |ИЗ
			               |	Документ.CRM_ЗаписьНаТестДрайв КАК CRM_ЗаписьНаТестДрайв
			               |ГДЕ
			               |	CRM_ЗаписьНаТестДрайв.РабочийЛист = &РабочийЛист
			               |	И CRM_ЗаписьНаТестДрайв.Проведен = ИСТИНА";
			Запрос.УстановитьПараметр("РабочийЛист", НомерТестДрайва);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Об = Выборка.Ссылка.ПолучитьОбъект();
				Об.РабочийЛист = ЗаписьРЛ.IDK;
				Об.Клиент = ЗаписьРЛ.Клиент;
				Об.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаписьНаСервис и Не ТрафикУпущен Тогда
		
		Документ = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
		
		Документ.Дата = ТекущаяДата();
		Документ.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.СРешепшен;
		Документ.ДилерскийЦентр = ДилерскийЦентр;
		
		//от Вити
		//Документ.Менеджер = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Сотрудник);
		
		Документ.Менеджер = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Администратор);
		
		//the-end
		
		Если ТипЗнч(Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") ИЛИ
			ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			Документ.Клиент = Клиент;
			
		Иначе
		
			Документ.Клиент = ФИО;
		
		КонецЕсли;
		
		Документ.Примечание = Комментарий + " Модель: " + Модель.Наименование;
		Документ.ПервичныйПовторный = ПервичныйПовторный;
		Документ.ОбращениеОбработано = Ложь;
		
		Попытка
		
			Документ.ИдентификаторТрафика = Идентификатор;
			
		Исключение
			
			
		Конецпопытки;
			
		Документ.Жалоба = Жалоба;
		
		Попытка
			
			Документ.ТелефонПримечание = Телефон;
			
		Исключение
			
			Документ.Примечание = Документ.Примечание + " Телефон клиента: " + Телефон;
			
		КонецПопытки;
		
		Документ.Записать();
		
		Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		
		Напоминание.Отправитель = Администратор;
		
		Напоминание.Подробнее = Документ.Ссылка;
		
		Напоминание.Адресаты.Добавить().Сотрудник = Сотрудник;
		
		ДатаОтправки = ТекущаяДата();
		
		Напоминание.ДатаОтправки = ДатаОтправки;
		
		Напоминание.Комментарий = Комментарий;
		
		Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера;
		
		Напоминание.ПоказыватьС = ДатаОтправки;
		Напоминание.ПоказыватьПо = ДатаОтправки;
		
		Напоминание.Наименование = ФИО;
		Напоминание.Сообщение = "На вас назначен клиент: " + ФИО + " | " + Комментарий + " | " + Модель.Наименование;;
		
		Напоминание.Записать();
		
	КонецЕсли;
	
	//создание рабочего листа и ТД
	////////////////////////////////////////////////
	
	////////////////////////////////////////////////
	//Временно	
	////////////////////////////////////////////////
	//Дилерский код                          
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Отдел", Отдел);
	СтруктураДанных.Вставить("ДилерскийЦентр", ДилерскийЦентр);
	СтруктураДанных.Вставить("ПервичныйПовторный", ПервичныйПовторный);
	СтруктураДанных.Вставить("Модель",Модель);
	СтруктураДанных.Вставить("ИсточникИнформации",ИсточникИнформации);
	СтруктураДанных.Вставить("Комментарий",Комментарий);
	СтруктураДанных.Вставить("Сотрудник",Сотрудник);
	СтруктураДанных.Вставить("Телефон",Телефон);
	СтруктураДанных.Вставить("Администратор",Администратор);
	СтруктураДанных.Вставить("ФИО",ФИО);
	СтруктураДанных.Вставить("ТипТрафика",ТипТрафика);
	СтруктураДанных.Вставить("Перезвонить",Перезвонить);
	СтруктураДанных.Вставить("ТрафикУпущен",ТрафикУпущен);
	Renault_МодульДилера.ПриСозданииТрафика(СтруктураДанных);

	// Внесем в планшет продавца запись о клиенте	
	Если ЗначениеЗаполнено(ДилерскийЦентр) И ВОтделПродаж И ТипТрафика = Справочники.CRM_ТипТрафика.ПосещениеАвтосалона Тогда
		Если ДилерскийЦентр.СинхронизированСПланшетомПродавца = Истина Тогда
			КлиентскиеДанные = Новый Структура;
			Если ЗначениеЗаполнено(Клиент) Тогда
				КлиентскиеДанные.Вставить("Идентификатор", Строка(Клиент.УникальныйИдентификатор()));
				КлиентскиеДанные.Вставить("Имя", Клиент.Имя);
				КлиентскиеДанные.Вставить("Фамилия", Клиент.Фамилия);
				КлиентскиеДанные.Вставить("Отчество", Клиент.Отчество);
				КлиентскиеДанные.Вставить("Телефон", Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент));
				КлиентскиеДанные.Вставить("Email", Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Клиент));
				КлиентскиеДанные.Вставить("ДатаРождения", Клиент.ДатаРождения);
			Иначе
				Если ЗаписьТрафик <> Неопределено Тогда
					КлиентскиеДанные.Вставить("Идентификатор", ЗаписьТрафик.Идентификатор);
					КлиентскиеДанные.Вставить("Имя", ФИО);
					КлиентскиеДанные.Вставить("Фамилия", "");
					КлиентскиеДанные.Вставить("Отчество", "");
					КлиентскиеДанные.Вставить("Телефон", Телефон);
					КлиентскиеДанные.Вставить("Email", "");
					КлиентскиеДанные.Вставить("ДатаРождения", '00010101');
				КонецЕсли;
			КонецЕсли;
			Если КлиентскиеДанные.Свойство("Идентификатор") Тогда
				
				мПараметры = Новый Массив;
				мПараметры.Добавить(ДилерскийЦентр);
				мПараметры.Добавить(КлиентскиеДанные);
				мПараметры.Добавить(ТекущаяДата());
				мПараметры.Добавить(Ложь);
				мПараметры.Добавить(Неопределено);
				
				Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
						
					мПараметры.Добавить(Клиент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да);	
				Иначе	
					мПараметры.Добавить(Ложь);	
				КонецЕсли;
				
				//ФоновыеЗадания.Выполнить("Renault_РаботаСSalesTablet.ОбновитьДанныеПоТрафику", мПараметры);
				// внесем в трафик отметку о синхронизации с планшетом продавца
				Если ЗначениеЗаполнено(Идентификатор) Тогда
					ЗаписьТрафика = Renault_CRM.ПолучитьЗаписьТрафикаПоID(Строка(Идентификатор));
					ЗаписьТрафика.Представление = ЗаписьТрафика.Представление;
					ЗаписьТрафика.Записать();
				КонецЕсли;
			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
			
&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов(ТрафикУпущен = Ложь)
	
	РеквизитыЗаполнены = Истина;
	МассивНеЗаполненных = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		РеквизитыЗаполнены = Ложь;
		МассивНеЗаполненных.Добавить("Дилерский центр");
	КонецЕсли;
	
	Если Перезвонить Тогда
		
		Если Не ЗначениеЗаполнено(Телефон) И МассивНеЗаполненных.Найти("Телефон") = Неопределено Тогда
			РеквизитыЗаполнены = Ложь;
			МассивНеЗаполненных.Добавить("Телефон");
		КонецЕсли;
		
	КонецЕсли;
		
	Если Не ТрафикУпущен Тогда
	
		Если Не ЗначениеЗаполнено(Пол) Тогда
			РеквизитыЗаполнены = Ложь;
			МассивНеЗаполненных.Добавить("Пол");
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(Отдел) Тогда
			РеквизитыЗаполнены = Ложь;
			МассивНеЗаполненных.Добавить("Отдел");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПервичныйПовторный) Тогда
			РеквизитыЗаполнены = Ложь;
			МассивНеЗаполненных.Добавить("Первичный / Повторный");
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(ТекстКомментарияУпущен) Тогда
			РеквизитыЗаполнены = Ложь;
			МассивНеЗаполненных.Добавить("Текст причины упущенного клиента");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Администратор) Тогда
		РеквизитыЗаполнены = Ложь;
		МассивНеЗаполненных.Добавить("Администратор");
	КонецЕсли;
	
	Если Не РеквизитыЗаполнены Тогда
		Текст = "Не заполнены поля: ";
		НужнаЗапятая = Ложь;
		Для Каждого Поле Из МассивНеЗаполненных Цикл
			Если НужнаЗапятая Тогда
				Текст = Текст + ", ";
			Иначе
				НужнаЗапятая = Истина;
			КонецЕсли;
			Текст = Текст + Строка(Поле);
		КонецЦикла;							
		Предупреждение(Текст);
	КонецЕсли;
	
	Возврат РеквизитыЗаполнены;
	
КонецФункции

&НаКлиенте
Процедура кнОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКарточкаКлиента(Команда)
	
	Профиль = ПолучитьПрофильКлиента(Клиент);	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Профиль.ПолучитьФорму(, ЭтаФорма).Открыть();
	#Иначе
    П = Новый Структура("ключ", Профиль);
	ОткрытьФорму("Справочник.Renault_ПрограммыЛояльности.Форма.ФормаЭлемента", П, ЭтаФорма);
	#КонецЕсли

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПрофильКлиента(Клиент)
	
	Возврат Справочники.Renault_ПрофилиКлиентов.СохранитьКлиентаВПрофиль(Клиент);
	
КонецФункции

&НаКлиенте
Процедура кнАвторазмер(Команда)
	
	ЭтаФорма.Ширина = 978;
	ЭтаФорма.Высота = 586;

КонецПроцедуры

&НаКлиенте
Процедура кнПолМужской(Команда)
	
	Пол = ПолучитьПол("Мужской");
	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура кнПолЖенский(Команда)
	
	Пол = ПолучитьПол("Женский");
	ОбновлениеОтображения();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПол(Пол)
	Возврат Перечисления.ПолФизическихЛиц[Пол];	
КонецФункции

&НаКлиенте
Процедура кнТипПервичный(Команда)
	
	ПервичныйПовторный = ПолучитьТипПовторный("Первичный");
	МенеджерЗамены = Неопределено;
	ОбновлениеОтображения();
	
КонецПроцедуры

&НаКлиенте
Процедура кнТипПовторный(Команда)
	
	ПервичныйПовторный = ПолучитьТипПовторный("Повторный");
	ИсточникИнформации = ПолучитьИсточникИнформации();
	ОбновлениеОтображения();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипПовторный(ТипПовторный)
	Возврат Перечисления.CRM_ПервичныйПовторный[ТипПовторный];	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИсточникИнформации()
	Возврат Справочники.CRM_ИсточникиИнформации.ПустаяСсылка();	
КонецФункции

&НаКлиенте
Процедура кнОтделПродажи(Команда)
	
	//Если Не ЗначениеЗаполнено(ДилерскийЦентр) Тогда
	//	кнВыборДЦНажатие(Неопределено);
	//КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		Предупреждение("Укажите дилерский центр");
		Возврат;
	КонецЕсли;
	
	Отдел = ОтделАвтосалона;
	
	Сотрудник = Неопределено;

	ОбновитьСтруктуруОткрываемыхФорм();
	ОбновлениеОтображения();
	
	////Переделать
	//Если ПервичныйПовторный = ПолучитьТипПовторный("Повторный") Тогда
	//	Если Не ЗначениеЗаполнено(Модель) Тогда
	//		кнМодель(Неопределено, Истина);
	//	КонецЕсли;
	//Иначе
	//	Если Не ЗначениеЗаполнено(ИсточникИнформации) Тогда
	//		кнИсточникИнформации(Неопределено, истина);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(Сотрудник) Тогда;
	//	кнМенеджер(Неопределено, Истина);
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура кнОтделДругой(Команда)
	
	Если Не ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		кнВыборДЦНажатие(Неопределено);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		Предупреждение("Укажите дилерский центр");
		Возврат;
	КонецЕсли;
	
	Парам=Новый Структура;
	Парам.Вставить("Список",Renault_CRM.ПолучитьСписокПрочихОтделовЦентра(ДилерскийЦентр));
	Парам.Вставить("Заголовок","Выбор отдела");
	Парам.Вставить("МножественныйВыбор",Ложь);
	//Парам.Вставить("КоличествоЭлементовВСтроке",4);
	Парам.Вставить("ШиринаЭлемента",17);
	Парам.Вставить("ВысотаЭлемента",2);
	Ответ=ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
	Если ЗначениеЗаполнено(Ответ) Тогда
		Отдел = Ответ;
		
		Если ИспользуетАвтосервис(ДилерскийЦентр) Тогда
			
			Если ЭтоОтделСервиса(Отдел) Тогда
				
				ЗаписьНаСервис = ИСТИНА;
				  
			Иначе
				
				ЗаписьНаСервис = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Отдел = Неопределено;
	КонецЕсли;
	
	Сотрудник = Неопределено;

	ОбновитьСтруктуруОткрываемыхФорм();
	ОбновлениеОтображения();
	
	////Переделать
	//Если ПервичныйПовторный = ПолучитьТипПовторный("Повторный") Тогда
	//	Если Не ЗначениеЗаполнено(Модель) Тогда
	//		кнМодель(Неопределено, Истина);
	//	КонецЕсли;
	//Иначе
	//	Если Не ЗначениеЗаполнено(ИсточникИнформации) Тогда
	//		кнИсточникИнформации(Неопределено, Истина);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(Сотрудник) Тогда;
	//	кнМенеджер(Неопределено, Истина);
	//КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользуетАвтосервис(ДилерскийЦентр)
	Возврат ДилерскийЦентр.ИспользуетАвтосервис;
КонецФункции

&НаСервереБезКонтекста
Функция ОтделСервисаПустой()
	Возврат Справочники.CRM_Отделы.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура кнИсточникИнформации(Команда, Параметр = Неопределено)
	
	Если Параметр = Неопределено ИЛИ СтруктураОткрываемыхФорм.ОткрыватьИсточникИнформации Тогда
		
		Список = ПолучитьСписокИсточниковИнформации();	

		Парам = Новый Структура;
		Парам.Вставить("Список", Список);
		Парам.Вставить("Заголовок", "Выбор источника информации");
		Парам.Вставить("ШиринаЭлемента",17);
		Парам.Вставить("ВысотаЭлемента",2);
		
		//Парам.Вставить("КоличествоЭлементовВСтроке", 4);
		ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);
		Ответ = ФормаСписка.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			ИсточникИнформации = Ответ;
		Иначе
			ИсточникИнформации = Неопределено;
		КонецЕсли;
		
		ОбновлениеОтображения();
		
	КонецЕсли;
	
	////Переделать
	//Если Не ЗначениеЗаполнено(Модель) Тогда
	//	кнМодель(Неопределено, Истина);
	//КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокИсточниковИнформации()
	
	Список = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсточникиИнформации.Ссылка
	               |ИЗ
	               |	Справочник.CRM_ИсточникиИнформации КАК ИсточникиИнформации
	               |ГДЕ
	               |	ИсточникиИнформации.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИсточникиИнформации.Наименование";
	МассивЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Список.ЗагрузитьЗначения(МассивЗначений);
	
	Возврат Список;

КонецФункции

&НаКлиенте
Процедура кнТипЖалоба(Команда)
	
	Если Отдел = ОтделСервисаПустой() или Отдел = Неопределено Тогда
		
		Вопрос("Для регистрации жалобы необходимо указать отдел", РежимДиалогаВопрос.ОК, , ,"Предупреждение!");
		Возврат;
		
	КонецЕсли;
	
	Если Жалоба Тогда
		Жалоба = не Жалоба;
	Иначе
		Жалоба = не Жалоба;
	КонецЕсли;
	
	ОбновлениеОтображения();
	
	Если не ЗаписьНаСервис Тогда
		
		кнЗамечаниеМенеджеру(Неопределено);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура кнМодель(Команда, Параметр = Неопределено)
	
	Если Параметр = Неопределено ИЛИ СтруктураОткрываемыхФорм.ОткрыватьМодель Тогда
		
		Список = ПолучитьПервичныйИнтерес(Отдел);

		Парам = Новый Структура;
		Парам.Вставить("Список", Список);
		Парам.Вставить("Заголовок", "Выбор модели автомобиля");
		Парам.Вставить("ШиринаЭлемента",17);
		Парам.Вставить("ВысотаЭлемента",2);

		ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);
			
		Если Не ЗначениеЗаполнено(Список) Тогда
		
			Список = Renault_CRM.ПолучитьПервичныйИнтерес(ДилерскийЦентр);
			
		КонецЕсли;
			
		ФормаСписка.СпЗн = Список;
		ФормаСписка.Заголовок = "Выбор модели автомобиля";
		Ответ = ФормаСписка.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			Модель = Ответ;
		Иначе
			Модель = Неопределено;
		КонецЕсли;
		
		ОбновлениеОтображения();
		
	КонецЕсли;
	
	//Если Отдел = ОтделАвтосалона или ЭтоОтделТрейдИн(Отдел) Тогда

	//Иначе
	//	
	//	//Переделать
	//	Если Не ЗначениеЗаполнено(Администратор) Тогда
	//		кнАдминистратор(Неопределено, Истина);
	//	КонецЕсли;
	//	
	//КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПервичныйИнтерес(Отдел)
	Возврат Справочники.CRM_Отделы.ПолучитьПервичныйИнтерес(Отдел);
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоОтделТрейдИн(Отдел)
	Возврат Отдел.КлассификацияRenault = Перечисления.CRM_КлассификацияОтделов.ОтделТрейдИн;
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоОтделСервиса(Отдел)
	Возврат Отдел.КлассификацияRenault = Перечисления.CRM_КлассификацияОтделов.ОтделСервиса;
КонецФункции

&НаКлиенте
Процедура кнЗаменаМенеджера(Команда)
	
	Если ЗначениеЗаполнено(МенеджерЗамены) Тогда
		МенеджерЗамены = Неопределено;
	Иначе	
		Список = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(Отдел);
		
		Парам = Новый Структура;
		Парам.Вставить("Список", Список);
		Парам.Вставить("Заголовок", "Выбор менеджера, которого заменили");
		Парам.Вставить("КоличествоЭлементовВСтроке", 2);

		ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);
		
		Ответ = ФормаСписка.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			МенеджерЗамены = Ответ;
		Иначе
			МенеджерЗамены = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура кнМенеджер(Команда, Параметр = Неопределено)
	
	Если Параметр = Неопределено ИЛИ СтруктураОткрываемыхФорм.ОткрыватьМенеджер Тогда
		
		Список = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(Отдел);
		
		ТаблицаСоСтатусом = ПолучитьСтатусыСотрудников(Список, ДилерскийЦентр);		
		
		Парам = Новый Структура;
		Парам.Вставить("Список",ТаблицаСоСтатусом);
		Парам.Вставить("Заголовок", ?(ЗаписьНаСервис,"Выбор мастера-приемщика","Выбор менеджера"));
		Парам.Вставить("ШиринаЭлемента",17);
		Парам.Вставить("ВысотаЭлемента",2);

		ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);			
		
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			ФормаСписка.Элементы.Закрыть.Заголовок = "Пока не знаю";
		КонецЕсли;
		Ответ = ФормаСписка.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			Сотрудник = Ответ;
		Иначе
			Сотрудник = Неопределено;
		КонецЕсли;
		
		ОбновлениеОтображения();
		
	КонецЕсли;
	
	////Переделать
	//Если Не ЗначениеЗаполнено(Администратор) Тогда
	//	кнАдминистратор(Неопределено, Истина);
	//КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция	ПолучитьСтатусыСотрудников(Список, ДилерскийЦентр)
	
	ТаблицаСтатусы = Renault_CRM.ПолучитьСтатусыСотрудников(Список);
	
	ТаблицаСоСтатусом = Renault_CRM.ПолучитьПредставлениеСотрудниковСоСтатусами(Список, ТаблицаСтатусы, ДилерскийЦентр);

	Возврат ТаблицаСоСтатусом;
	
КонецФункции

&НаКлиенте
Процедура кнЗамечаниеМенеджеру(Команда)
	
	ФормаВводаЗамечания = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВводаКомментарияУПР");
	ФормаВводаЗамечания.Заголовок = "Ввод замечания менеджеру";
	ФормаВводаЗамечания.Текст = ТекстЗамечания; 
	Ответ = ФормаВводаЗамечания.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Или Ответ = "" Тогда
		ТекстЗамечания = Ответ;
	КонецЕсли;
	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура кнАдминистратор(Команда, Параметр = Неопределено)
	
	Если Параметр = Неопределено ИЛИ СтруктураОткрываемыхФорм.ОткрыватьАдминистратор Тогда
		
		Список = Renault_CRM.ПолучитьСписокСотрудниковРесепшн(ДилерскийЦентр);
		
		ТаблицаСоСтатусами = ПолучитьСтатусыСотрудников(Список, ДилерскийЦентр);
		
		Парам = Новый Структура;
		Парам.Вставить("Список",ТаблицаСоСтатусами);
		Парам.Вставить("Заголовок", "Выбор администратора");
		Парам.Вставить("ШиринаЭлемента",17);
		Парам.Вставить("ВысотаЭлемента",2);

		ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);
		
		Ответ = ФормаСписка.ОткрытьМодально();
		Если ЗначениеЗаполнено(Ответ) Тогда
			Администратор = Ответ;
		Иначе
			Администратор = Неопределено;
		КонецЕсли;
		
		ОбновлениеОтображения();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура кнУпущенныйКлиент(Команда)
	
	ФормаВводаЗамечания = ПолучитьФорму("Обработка.Renault_ARM_Администратор.Форма.ФормаВводаПричиныУпущенногоКлиентаУПР");
	ФормаВводаЗамечания.Заголовок = "Ввод причины упущенного клиента";
	ФормаВводаЗамечания.Текст = ТекстКомментарияУпущен;
	ФормаВводаЗамечания.ПричинаУпущенногоКлиента = ПричинаУпущенногоКлиента;
	Ответ = ФормаВводаЗамечания.ОткрытьМодально();
	Если ЗначениеЗаполнено(Ответ) Тогда
		ТекстКомментарияУпущен   = Ответ.ТекстКомментарияУпущен;
		ПричинаУпущенногоКлиента = Ответ.ПричинаУпущенногоКлиента;
	КонецЕсли;
	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтрагентаПоEmail()
	
	НайденныеКлиенты = НайтиСписокПоEmail(Телефон);
	
	Если НайденныеКлиенты.Количество() = 1 Тогда
		
		Ответ = НайденныеКлиенты[0].Контрагент;
		Если ЗначениеЗаполнено(Ответ) Тогда
			Клиент = Ответ;
			ФИО = Ответ.Наименование;
			Пол = Ответ.Пол;
			ОбновлениеОтображения();
		КонецЕсли;
		
		Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Ответ);
		
	ИначеЕсли  НайденныеКлиенты.Количество() > 1 Тогда
		
		сКлиентов = Новый СписокЗначений;
		Для Каждого СтрТЗ из НайденныеКлиенты Цикл
			сКлиентов.Добавить(СтрТЗ.Контрагент, Строка(СтрТЗ.Контрагент));
		КонецЦикла;
		
		Парам = Новый Структура;
		Парам.Вставить("Список",сКлиентов);
		Парам.Вставить("Заголовок", "Найдены клиенты с данным телефоном");
		Парам.Вставить("КоличествоЭлементовВСтроке",2);

		ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);
		
		Ответ = ФормаСписка.ОткрытьМодально();
		Если Ответ <> Неопределено Тогда
			Клиент = Ответ;
			ФИО = Ответ.Наименование;
			Пол = Ответ.Пол;
			ОбновлениеОтображения();
		КонецЕсли;
		
		Телефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Ответ);
			
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтрагентаПоТелефону() Экспорт
	
	НайденныеКлиенты = НайтиСписокПоФрагменту();
		
	Если НайденныеКлиенты.Количество() = 1 Тогда
		
		НайденныйКлиент = НайденныеКлиенты[0].Контрагент;
		Если Вопрос("Найден клиент с данным телефоном - "+НайденныйКлиент.Наименование+", заменить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Клиент = НайденныйКлиент;
			ФИО = Клиент.Наименование;
			Пол = Клиент.Пол;
			ОбновлениеОтображения();			
		КонецЕсли;	
		
	ИначеЕсли  НайденныеКлиенты.Количество() > 1 Тогда
		
		сКлиентов = Новый СписокЗначений;
		Для Каждого СтрТЗ из НайденныеКлиенты Цикл
			сКлиентов.Добавить(СтрТЗ.Контрагент, Строка(СтрТЗ.Контрагент));
		КонецЦикла;
		
		Парам = Новый Структура;
		Парам.Вставить("Список",сКлиентов);
		Парам.Вставить("Заголовок", "Найдены клиенты с данным телефоном");
		Парам.Вставить("КоличествоЭлементовВСтроке",2);

		ФормаСписка = ПолучитьФорму("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений", Парам);

		Ответ = ФормаСписка.ОткрытьМодально();
		Если Ответ <> Неопределено Тогда
			Клиент = Ответ;
			ФИО = Ответ.Наименование;
			Пол = Ответ.Пол;
			ОбновлениеОтображения();
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция НайтиСписокПоФрагменту()
	
	// Текст запроса для построения временной таблицы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	               |	Renault_НормализованныеКонтактыДляПоиска.Объект КАК Контрагент,
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные
	               |ИЗ
	               |	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска
	               |ГДЕ
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные ПОДОБНО &Фрагмент";
	
	Фрагмент = СокрЛП(Телефон);
	
	Фрагмент = СтрЗаменить(Фрагмент, "+", "");
	Фрагмент = СтрЗаменить(Фрагмент, "-", "");
	Фрагмент = СтрЗаменить(Фрагмент, ".", "");
	Фрагмент = СтрЗаменить(Фрагмент, "*", "");
	Фрагмент = СтрЗаменить(Фрагмент, " ", "");
	Фрагмент = СтрЗаменить(Фрагмент, "(", "");
	Фрагмент = СтрЗаменить(Фрагмент, ")", "");
	
	Если Найти(Фрагмент, "7") = 1 ИЛИ Найти(Фрагмент, "8") = 1 Тогда
		
		Фрагмент = Прав(Фрагмент, СтрДлина(Фрагмент) - 1);
		
	КонецЕсли;
	
	Если НЕ Renault_СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Фрагмент, Истина, Истина) Тогда
		
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;

	Запрос.УстановитьПараметр("Фрагмент", "%" + Фрагмент + "%");
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиСписокПоEmail(Email) 
	
	// Текст запроса для построения временной таблицы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_НормализованныеКонтактыДляПоиска.Объект КАК Контрагент,
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные
	               |ИЗ
	               |	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска
	               |ГДЕ
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные ПОДОБНО &Фрагмент";
	
	Фрагмент = Email;
	
	Фрагмент = СтрЗаменить(Фрагмент, "+", "");
	Фрагмент = СтрЗаменить(Фрагмент, "-", "");
	Фрагмент = СтрЗаменить(Фрагмент, ".", "");
	Фрагмент = СтрЗаменить(Фрагмент, "*", "");
	Фрагмент = СтрЗаменить(Фрагмент, " ", "");
	Фрагмент = СтрЗаменить(Фрагмент, "(", "");
	Фрагмент = СтрЗаменить(Фрагмент, ")", "");

	Запрос.УстановитьПараметр("Фрагмент", "%" + Фрагмент + "%");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции
